# catalog/data.py

SITE_INFO = {
    "title": "Каталог курсов",
    "about": "Мини-сайт на Django без базы данных. Данные хранятся в константах."
}

AUTHORS = [
    {"id": 1, "name": "Иван Петров", "bio": "Нумеролог."},
    {"id": 2, "name": "Анна Смирнова", "bio": "Астролог."},
    {"id": 3, "name": "Дмитрий Иванов", "bio": "Психолог."},
]

COURSES = [
    {"id": 1, "title": "Введение в нумерологию", "description": "История и школы нумерологии от древности до современности", "author_id": 1, "level": "Beginner"},
    {"id": 2, "title": "Виды нумерологии", "description": "Западная (пифагорейская) нумерологи, Ведическая нумерологи, Китайская нумерология У-Син", "author_id": 1, "level": "Middle"},
    {"id": 3, "title": "Натальная карта", "description": "Узнаем положение ваших планет, которые влияют на вашу жизнь", "author_id": 2, "level": "Beginner"},
    {"id": 4, "title": "Как принять себя таким, какой ты есть", "description": "Узнаете как научиться жить с самим с собой", "author_id": 3, "level": "Advanced"},
]
